OpenFoamCase/Water_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    Side
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    Bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    Top
    {
	type            zeroGradient;
    }
       
    Inlet-Top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);   	
    } 

    Inlet
    {
        type            	flowRateInletVelocity;
        volumetricFlowRate	constant 2.e-06;
	value           	uniform (0 0 0);  	
    } 

    Exit
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);    
    }
    

    defaultFaces
    {
        type            empty;
    }
    
}


// ************************************************************************* //
