OpenFoamCase/Water_case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Side
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    Bottom
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    
    Top
    {
        type		zeroGradient;
    }    

    Inlet-Top
    {
        //type		zeroGradient;
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    } 

    Inlet
    {
	type            fixedFluxPressure;
        value           uniform 0;
    } 

    Exit
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
