OpenFoamCase/Water_case/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.e-03;

vertices
(
    // Dummy point, numbering starts from 1
    (100 100 100)	
    
    ( 0		0	0      )
    (-1.0	0	1.732  )
    (-3.5	0	6.062  )
    (26.5	0	58.022 )
    (29.0	0	53.693 )
    (30		0	51.961 )    

    ( 0		12.5	0      )
    (-1.0	12.5	1.732  )
    (-3.5	12.5	6.062  )
    (26.5	12.5	58.022 )
    (29.0	12.5	53.693 )
    (30		12.5	51.961 )
    
    ( 0		37.5	0      )
    (-1.0	37.5	1.732  )
    (-3.5	37.5	6.062  )
    (26.5	37.5	58.022 )
    (29.0	37.5	53.693 )
    (30		37.5	51.961 )
    
    ( 0		50.0	0      )
    (-1.0	50.0	1.732  )
    (-3.5	50.0	6.062  )
    (26.5	50.0	58.022 )
    (29.0	50.0	53.693 )
    (30		50.0	51.961 )
          
);

blocks
(
     	hex (1 2 5 6 7 8 11 12) (8 240 50) simpleGrading (1 1 1)

	hex (2 3 4 5 8 9 10 11) (20 240 50) simpleGrading (1 1 1)

	hex (7 8 11 12 13 14 17 18) (8 240 100) simpleGrading (1 1 1)

	hex (8 9 10 11 14 15 16 17) (20 240 100) simpleGrading (1 1 1)

	hex (13 14 17 18 19 20 23 24) (8 240 50) simpleGrading (1 1 1)

	hex (14 15 16 17 20 21 22 23) (20 240 50) simpleGrading (1 1 1)
);

edges
(
 
	
);


boundary
(

    Inlet-Top
    {
        type            patch;
        faces
        (
            (6 5 11 12)
            (5 4 10 11)

            (11 10 16 17)
	    
            (18 17 23 24)
            (17 16 22 23)	    
	    
        );
    }
    
    Top
    {
        type            patch;
        faces
        (
            (3 9 10 4)
            
	    (9 15 16 10)
            
	    (15 21 22 16)	    
        );
    }
    
    Exit
    {
        type            patch;
        faces
        (
            (1 2 8 7)
            (2 3 9 8)
            
	    (7 8 14 13)
            (8 9 15 14)	    
            
	    (13 14 20 19)
            (14 15 21 20)
        );
    }
    
    Side
    {
        type            wall;
        faces
        (
            (1 2 5 6)
            (2 3 4 5)
	    
            (19 20 23 24)
            (20 21 22 23)	    
        );
    }
    
    Bottom
    {
        type            wall;
        faces
        (
            (1 7 12 6)

            (7 13 18 12)

            (13 19 24 18)	    
        );
	
    }
    
    Inlet
    {
        type            patch;
        faces
        (
            (12 11 17 18)
        );
    }


);


mergePatchPairs
(
);

// ************************************************************************* //
